#-------------------------------------------------#
# Expectations of exponential function wrt Normal #
#-------------------------------------------------#

# ∫ exp(x) N(x|μ,σ) dx

E_(μ, σ)  = exp(μ + σ^2 / 2)

# ∫ exp(x + b) N(x|μ,σ) dx

E_(μ, σ, b)  = exp(μ + σ^2 / 2 + b)

# ∫ exp(a*x+b) N(x|μ,σ) dx

E_(a, μ, σ, b) = E_(a*μ, a*σ, b)

# The method below will be the one used

"""
∫ exp(a*x+b) N(x|μ,σ) dx
"""
E(;a = 1.0, μ = μ, σ = σ, b = 0.0) = E_(a, μ, σ, b)



#---------------------------------------------------------#
# Expectations of squared exponential function wrt Normal #
#---------------------------------------------------------#

B_(μ, σ) = E_(2μ, 2σ)

B_(μ, σ, b) = E_(2*μ, 2*σ, 2*b)

B_(α, μ, σ, b) = E_(2*α*μ, 2*α*σ, 2b)

"""
∫ [exp(a*x+b)]² N(x|μ,σ) dx
"""
B(;a=a, μ=μ, σ=σ, b=b) = E_(2*a*μ, 2*a*σ, 2b)



#---------------------------------------------#
# Variance of exponential function wrt Normal #
#---------------------------------------------#

V_(μ, σ) = B_(μ, σ) - E_(μ, σ)^2

V_(α, μ, σ) = B_(α, μ, σ) - E_(α, μ, σ)^2

V_(α, μ, σ, b) = B_(α, μ, σ, b) - E_(α, μ, σ, b)^2

"""
∫ [exp(a*x+b) - m]² N(x|μ,σ) dx, 

where m = ∫ exp(a*x+b) N(x|μ,σ) dx
"""
V(;a=a, μ=μ, σ=σ, b=b) = V_(a, μ, σ, b)




#-------------------------------------------------#
# ∫ N(x|μ, σ) log N(y | c ⋅ exp(a⋅x + b), β⁻¹) dx #
#-------------------------------------------------#
"""
∫ N(x|μ, σ) log N(y | exp(a⋅x + b), β⁻¹) dx
"""
Elognormal(;y=y, a=a, μ=μ, b=b, c=c, σ=σ, β=β) = -0.5*log(2π) + 0.5*log(β) - 0.5*β*abs2(y - c*E(a = a, μ = μ, σ = σ, b = b)) - β/2 * c^2 * V(a = a, μ = μ, σ = σ, b = b)


# let

#     y, a, μ, σ, b, β = 0.4, 1.9, -1.2, 0.95, 3.0, 1/1.3
    
#     p = Normal(μ, σ)

#     quadgk(x -> pdf(p, x) * logpdf(Normal(exp(a*x+b), sqrt(1/β)), y),-23.0,23.0)[1], Elognormal(;y=y, a=a, μ=μ, b=b, σ=σ, β=β)

# end